# **PREPARE DATA FOR NOSQL TOOLS**

In [30]:
import pandas as pd

## **1. LOAD DATA**

In [31]:
brands = pd.read_csv("../data/brands.csv")
categories = pd.read_csv("../data/categories.csv")
customers = pd.read_csv("../data/customers.csv")
order_items = pd.read_csv("../data/order_items.csv")
orders = pd.read_csv("../data/orders.csv")
products = pd.read_csv("../data/products.csv")
staffs = pd.read_csv("../data/staffs.csv")
stocks = pd.read_csv("../data/stocks.csv")
stores = pd.read_csv("../data/stores.csv")

## **2. MERGE DATA**

In [32]:
result = pd.merge(orders, order_items, on="order_id")
result

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id,item_id,product_id,quantity,list_price,discount
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2,1,20,1,599.99,0.20
1,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2,2,8,2,1799.99,0.07
2,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2,3,10,2,1549.00,0.05
3,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2,4,16,2,599.99,0.05
4,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2,5,4,1,2899.99,0.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4717,1614,135,3,2018-11-28,2018-11-28,NaN,3,8,2,159,2,2299.99,0.07
4718,1614,135,3,2018-11-28,2018-11-28,NaN,3,8,3,213,2,269.99,0.20
4719,1615,136,3,2018-12-28,2018-12-28,NaN,3,8,1,197,2,2299.99,0.20
4720,1615,136,3,2018-12-28,2018-12-28,NaN,3,8,2,214,1,899.99,0.07
4721,1615,136,3,2018-12-28,2018-12-28,NaN,3,8,3,182,1,2499.99,0.20

In [33]:
orders[:5]

,order_id,customer_id,order_status,order_date,required_date,shipped_date,store_id,staff_id
0,1,259,4,2016-01-01,2016-01-03,2016-01-03,1,2
1,2,1212,4,2016-01-01,2016-01-04,2016-01-03,2,6
2,3,523,4,2016-01-02,2016-01-05,2016-01-03,2,7
3,4,175,4,2016-01-03,2016-01-04,2016-01-05,1,3
4,5,1324,4,2016-01-03,2016-01-06,2016-01-06,2,6

In [34]:
order_items[:5]

   order_id  item_id  product_id  quantity  list_price  discount
0         1        1          20         1      599.99      0.20
1         1        2           8         2     1799.99      0.07
2         1        3          10         2     1549.00      0.05
3         1        4          16         2      599.99      0.05
4         1        5           4         1     2899.99      0.20